In [1]:
#Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [2]:
import pandas as pd

In [3]:

pd_series = pd.Series([4,8,15,16,23,42])

In [4]:

pd_series

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [5]:
type(pd_series)

pandas.core.series.Series

In [6]:
#Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the variable print it.

In [7]:
import numpy as np

data = np.random.randint(20,50,size = 10)

In [8]:
data

array([20, 34, 39, 44, 24, 26, 26, 22, 20, 44])

In [9]:

s = pd.Series(data)

In [10]:
s

0    20
1    34
2    39
3    44
4    24
5    26
6    26
7    22
8    20
9    44
dtype: int64

In [11]:
type(s)

pandas.core.series.Series

In [12]:
type(data)

numpy.ndarray

In [13]:
#Q3. Create a Pandas DataFrame that contains the following data:
Name Alice Bob Claire
Age 25 30 27
Gender Female Male Female

In [14]:
data = {"Name" : ["Alice","Bob","Claire"],"Age" : [25,30,27],"Gender" : ["Female","Male","Female"]}

In [15]:
data

{'Name': ['Alice', 'Bob', 'Claire'],
 'Age': [25, 30, 27],
 'Gender': ['Female', 'Male', 'Female']}

In [16]:
df = pd.DataFrame(data)

In [17]:
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [18]:
type(df)

pandas.core.frame.DataFrame

In [19]:
#Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

In [20]:
#In Pandas, a DataFrame is a two-dimensional, tabular data structure that can store data of different types (numeric, string, boolean, etc.) in rows and columns. It is one of the most commonly used data structures in Pandas and is similar to a spreadsheet or a SQL table. A DataFrame is designed to handle structured data and offers a wide range of operations and functionalities for data manipulation, analysis, and cleaning.

#On the other hand, a Pandas Series is a one-dimensional array-like data structure that can hold a single column of data with an associated index. Think of it as a labeled array. It is more similar to a list or a NumPy array, but with the added feature of an index, which allows for more powerful and efficient data alignment and labeling.

In [21]:
#using the same data from 3 question
data

{'Name': ['Alice', 'Bob', 'Claire'],
 'Age': [25, 30, 27],
 'Gender': ['Female', 'Male', 'Female']}

In [22]:
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [23]:
df.columns

Index(['Name', 'Age', 'Gender'], dtype='object')

In [24]:
df.dtypes

Name      object
Age        int64
Gender    object
dtype: object

In [25]:

df['Name']

0     Alice
1       Bob
2    Claire
Name: Name, dtype: object

In [26]:
type(df['Name'])

pandas.core.series.Series

In [27]:
df[['Name']]

     Name
0   Alice
1     Bob
2  Claire

In [28]:

type(df[['Name','Gender']])

pandas.core.frame.DataFrame

In [30]:
#Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can you give an example of when you might use one of these functions?

#Handling Missing Data: You can handle missing values using functions like dropna or fillna.
#Filtering Data: You can filter rows based on specific conditions using functions like loc, iloc
#Sorting Data: You can sort the DataFrame by one or more columns using the sort_values function.
#Aggregation: You can perform aggregate operations on specific columns using functions like mean, sum, min, max, etc.

In [31]:

data = {'A': [1, 2, None, 4], 'B': [5, None, 7, 8]}
df = pd.DataFrame(data)

In [32]:
#Handling Missing Data

In [33]:
df

     A    B
0  1.0  5.0
1  2.0  NaN
2  NaN  7.0
3  4.0  8.0

In [34]:

# Drop rows with any missing value
clean_df = df.dropna()
clean_df

     A    B
0  1.0  5.0
3  4.0  8.0

In [35]:

# Filling rows with 3 in the missing values
cleann_df = df.fillna(3)
cleann_df

     A    B
0  1.0  5.0
1  2.0  3.0
2  3.0  7.0
3  4.0  8.0

In [36]:
#Filtering Data

In [37]:
df = pd.read_csv("https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv")

In [38]:

df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [39]:

df.iloc[2:6]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q

In [40]:
df.loc[2:6]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S

In [41]:
#getting the rows based on the index numbers of the coloumn passed in the same order as passed
df.iloc[2:6 , [3,5,4,8,9]]

,Name,Age,Sex,Ticket,Fare
2,"Heikkinen, Miss. Laina",26.0,female,STON/O2. 3101282,7.9250
3,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",35.0,female,113803,53.1000
4,"Allen, Mr. William Henry",35.0,male,373450,8.0500
5,"Moran, Mr. James",NaN,male,330877,8.4583